import React from 'react';


export const Dinosauria = () => {
  
  return (
    <div className='dinosauria'>
      <h1>Динозавры</h1>
      <h2>Стегозавр</h2>
      <p>Род позднеюрских травоядных динозавров, существовавший 155—145 млн лет назад (киммериджский ярус). В его составе выделено три вида. Благодаря шипам на хвосте и костяным пластинам на спине являются одними из самых узнаваемых динозавров.</p>
      <p>Стегозавры были крупнейшими представителями своего инфраотряда, включавшего также роды Kentrosaurus и Huayangosaurus. Их максимальная длина составляла 9 метров (S. armatus), высота — 4 метра. Грегори Пол оценил длину вида stegosaurus ungulatus в 7 м и вес в 3,8 тонн.Мозг динозавра был не больше, чем у собаки: при весе животного в 2 тонны его мозг весил лишь 70 граммов.</p>
      <h2>Мозазавр</h2>
      <p>Род вымерших морских пресмыкающихся из семейства мозазавров отряда чешуйчатых. Одни из последних и наиболее развитых представителей семейства. Mosasaurus hoffmanni — самый крупный и первый описанный представитель мозазавров, отдельные особи этого вида достигали длины более 17 метров.</p>
      <p>Первые ископаемые остатки мозазавров были найдены в известняковом карьере в Маастрихте на Маасе в 1764 году. В настоящее время ископаемые остатки представителей этого семейства уже были обнаружены на всех континентах, включая Антарктиду. Мозазавры представляли собой большую группу верхнемеловых морских рептилий, главным образом хищников крупных или средних размеров. Большинство известных видов населяло тёплые, мелководные моря, широко распространённые в позднем меловом периоде. В силу своей специализации, мозазавры очень сильно отличались от современных ящериц: строение их внутренних органов больше напоминало таковое у китообразных, они были живородящими, имели высокие темпы обмена веществ и были теплокровными.</p>
      <h3>Тираннозавр</h3>
      <p>Род плотоядных тероподовых динозавров из семейства тираннозаврид, включающий единственный валидный вид — Tyrannosaurus rex (лат. rex — «царь»). Обитал в западной части Северной Америки, которая в те времена представляла собой остров Ларамидию, и был наиболее распространённым из тираннозаврид. Ископаемые остатки тираннозавров находят в различных геологических формациях, датирующихся маастрихтским веком мелового периода, около 70,6—66,043 миллиона лет назад. Был одним из последних нептичьих динозавров, существовавших перед катаклизмом, положившим конец мезозойской эре (мел-палеогеновым вымиранием).</p>

    </div>
  );
};
