import React from 'react';

export const Home = () => {
  return (
    <div className='home'>
      <h1>Список лучших сериалов!</h1>
      <h2><li>The Big Bang Theory</li></h2>
      <p>Американский ситком, созданный Чаком Лорри и Биллом Прэди, которые наряду со Стивеном Моларо являлись главными сценаристами телешоу.    </p>
      <h2><li>Scrubs</li></h2>
      <p>Американский комедийно-драматический телевизионный сериал, посвящённый работе и жизни молодых врачей. Сериал был создан Биллом Лоуренсом и спродюсирован телекомпанией «Тачстоун» (англ. Touchstone Television, с 2007 года носящей название ABC Studios и входящей в компанию ABC). Несмотря на принадлежность сериала к жанру комедии, наряду со смешными в нём присутствуют и серьёзные, драматические моменты и сцены.</p>
      <h2><li>How I Met Your Mother</li></h2>
      <p>Американский комедийный телесериал, созданный Картером Бейзом и Крейгом Томасом. В основе сюжета лежит рассказ одного из главных героев — Теда Мосби, который в 2030 году описывает дочери и сыну события жизни его и его друзей в Нью-Йорке 2000-х годов до знакомства с будущей женой.</p>
      <h2><li>Firefly</li></h2>
      <p>Американский научно-фантастический телесериал в жанре космического вестерна, премьера которого состоялась в США и Канаде 20 сентября 2002 года. Идея была воплощена в жизнь сценаристом и режиссёром Джоссом Уидоном — создателем телесериалов «Баффи — истребительница вампиров» и «Ангел».</p>
    </div>
  );
};
